# -*- eval: (save-excursion (org-babel-goto-named-src-block "workshopPreamble") (org-babel-execute-src-block)) -*-
#+TITLE:     Stata Graphics
#+AUTHOR:    
#+EMAIL:     dataclass@help.hmdc.harvard.edu
#+DATE:      


# NOTE: refer to the README file if you are unfamiliar with emacs or orgmode.

# Customize the PROPERTY and EXCLUDE_TAGS below depending on the type
# of export (see the README file for details). After setting the exports 
# property and/or the EXCLUDE_TAGS, place the curser on the poperty line 
# and press C-c C-c

#+PROPERTY: exports both
#+EXCLUDE_TAGS: noexport mitsetup







#+SETUPFILE: ../workshopPreamble.org

#+name: workshopPreamble
#+begin_src emacs-lisp :exports none :results silent :tangle no
  (set (make-local-variable 'org-confirm-babel-evaluate) nil)
  (load-file "../setupEnvironment.el")
#+end_src

#+name: stataPreamble
#+begin_src stata :exports none :results silent :tangle no
  set more off
#+end_src


** Our First Dataset
- Time Magazine Public School Poll
  - Based on survey of 1,000 adults in U.S.
  - Conducted in August 2010
  - Questions regarding feelings about parental involvement, teachers union, current potential for reform

- Open Stata and call up the datafile for today

#+name: OpenData
#+begin_src stata
  // Step 1: tell Stata where to find data:
  cd "~/StataGraphics/dataSets"
  // Step 2: call up our dataset:
  use TimePollPubSchools.dta
#+end_src

#+RESULTS: OpenData
#+begin_example

cd "~/StataGraphics/dataSets"
/nfs/home/I/izahn/StataGraphics/dataSets

use TimePollPubSchools.dta
#+end_example


